// 1. Напишите 2 цикла. Один будет считать от 10 до 0, другой от 0 до 10. Напишите с помощью FOR и с помощью WHILE. В конечном результате будет 4 цикла.

// let i = 0;
// while (i < 10) { 
//   i++;
//   console.log( i );
// }

// let i = 10
// while(i) { 
//     i--
//     console.log( i )
// }

// for (let i = 0; i <= 10; i++)
// console.log(i)

// for (let i = 10; i >= 0 ; i--)
// console.log(i)

// 2.   Создайте массив разных данных простых типов ( примитивов), не менее 15 элементов в массиве. Создайте переменную с пустой строкой. Пройдитесь циклом FOR по массиву.
//      В теле  цикла ( там где мы пишем код {} ) сделайте проверку, если элемент массива при переводе в булевое значение будет положительным, тогда запишите его в строку, разделяя
//      её пробелом.

// let random= [55, '74', 'lol', 77, 'hey', 1, 1999, 'abc', 10, 9, 'real', 'number', 100, "0", 777]

// for ( )
